vapix/onvif-request/app/initial-info-request/GetMetadataConfigurationOptions.xml

<!-- Enpoint: /vapix/services -->

<!-- Request: GetMetadataConfigurationOptions -->

<?xml version="1.0" encoding="UTF-8"?>
<Envelope xmlns="http://www.w3.org/2003/05/soap-envelope">
    <Header/>
    <Body >
        <GetMetadataConfigurationOptions xmlns="http://www.onvif.org/ver20/media/wsdl" />
    </Body>
</Envelope>

<!-- Response: GetMetadataConfigurationOptionsResponse -->

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope"
    xmlns:SOAP-ENC="http://www.w3.org/2003/05/soap-encoding"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:c14n="http://www.w3.org/2001/10/xml-exc-c14n#"
    xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
    xmlns:ds="http://www.w3.org/2000/09/xmldsig#"
    xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
    xmlns:wsa5="http://www.w3.org/2005/08/addressing"
    xmlns:tt="http://www.onvif.org/ver10/schema"
    xmlns:wsnt="http://docs.oasis-open.org/wsn/b-2"
    xmlns:tns1="http://www.onvif.org/ver10/topics"
    xmlns:tnsaxis="http://www.axis.com/2009/event/topics"
    xmlns:tev="http://www.onvif.org/ver10/events/wsdl"
    xmlns:tr2="http://www.onvif.org/ver20/media/wsdl"
    xmlns:axt="http://www.onvif.org/ver20/analytics"
    xmlns:ter="http://www.onvif.org/ver10/error">
    <SOAP-ENV:Header></SOAP-ENV:Header>
    <SOAP-ENV:Body>
        <tr2:GetMetadataConfigurationOptionsResponse>
            <tr2:Options>
                <tt:PTZStatusFilterOptions>
                    <tt:PanTiltStatusSupported>false</tt:PanTiltStatusSupported>
                    <tt:ZoomStatusSupported>false</tt:ZoomStatusSupported>
                    <tt:PanTiltPositionSupported>false</tt:PanTiltPositionSupported>
                    <tt:ZoomPositionSupported>false</tt:ZoomPositionSupported>
                </tt:PTZStatusFilterOptions>
            </tr2:Options>
        </tr2:GetMetadataConfigurationOptionsResponse>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
